using EventManagementSystem.Models.Entities;

namespace EventManagementSystem.Models.Strategies
{
    //Strategy; Дефинира метод за сортиране. Това е интерфейс, който конкретните стратегии за сортиране трябва да имплементират.
    public interface ISortingStrategy
    {
        /*Описание: Strategy шаблонът дефинира семейство от алгоритми (например различни стратегии за сортиране) 
         * и позволява на клиента да избере подходящия алгоритъм по време на изпълнение. В този случай, 
         * ISortingStrategy определя интерфейс за сортиране, а SortByDateStrategy и SortByTitleStrategy 
         * предоставят различни методи за сортиране на събитията.
         * 
        Причина за използване: Strategy шаблонът позволява лесно превключване между различни алгоритми за сортиране, 
        без да се променя основния код за обработка на събития. Това го прави подходящ за проекти, 
        където логиката за сортиране може да варира в зависимост от изискванията на потребителя или бизнес логиката.*/


        /*
         Strategy pattern се използва за различни стратегии за сортиране на събитията – по дата, заглавие и др.
         */
        IEnumerable<Event> Sort(IEnumerable<Event> events);
    }
}
