using EventManagementSystem.Models.Entities;

namespace EventManagementSystem.Models.Factories
{
    //Abstract Factory; Дефинира интерфейс за създаване на обекти от класовете Participant.
    public interface IParticipantFactory
    {
        /*
         Ще използваме Factory Pattern, за да създаваме участници с различни роли. Например, можем да имаме участници с роли като "Speaker" или "Attendee".
         */

        /*Описание: Шаблонът Abstract Factory позволява създаването на свързани или зависими обекти, 
         * без да се уточнява техният конкретен клас. В този случай се използва за създаване на различни видове 
         * събития и участници, като ConferenceEvent и SeminarEvent.


        Причина за използване: Абстрактната фабрика е подходяща, когато проектът изисква гъвкавост при 
        създаването на обекти, които могат да принадлежат към различни категории 
        (като различни видове събития или роли на участници). Този шаблон дава възможност за лесно разширяване 
        на системата, като се добавят нови типове събития или участници, без да се променя съществуващия код.*/
        Participant CreateParticipant(string name, string role);
    }
}
